In [2]:
import pandas as pd
import numpy as np

In [4]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m , columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    17     7     7
1    12     2    16
2     8     8    26
3    23     3    16
4    24    25     7
5     7    19     5
6    22    21     3
7     5     3    22
8     2    14    29
9    19    18    26

In [5]:
#loc ve iloc

In [7]:
#loc:tanimlandigi sekli ile secim yapmak icin kullanilir

In [8]:
df.loc[0:3]

   var1  var2  var3
0    17     7     7
1    12     2    16
2     8     8    26
3    23     3    16

In [9]:
#iloc:alisik olunan indexleme ile secim yapar

In [10]:
df.iloc[0:3]

   var1  var2  var3
0    17     7     7
1    12     2    16
2     8     8    26

In [11]:
df.iloc[0,0]

17

In [12]:
df.iloc[:3,:2]

   var1  var2
0    17     7
1    12     2
2     8     8

In [14]:
df.loc[0:3,"var3"] #iloc indexli seci almaz. yani ilocla calismaz

0     7
1    16
2    26
3    16
Name: var3, dtype: int32

In [17]:
df.iloc[0:3]["var3"] # bu sekilde calisir

0     7
1    16
2    26
Name: var3, dtype: int32

In [19]:
df.iloc[0:3, 1:3]

   var2  var3
0     7     7
1     2    16
2     8    26